# SetImagePopupSelectedItem

## Description
Sets the selected image popup item. The itemIndex parameter is 1-based.

```pascal
PROCEDURE SetImagePopupSelectedItem(
				dialogID    : LONGINT;
				componentID : LONGINT;
				itemIndex   : INTEGER);
```

```python
def vs.SetImagePopupSelectedItem(dialogID, componentID, itemIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|Index to the dialog layout that contains the image popup component.|
|componentID|LONGINT|Index to a specific image popup component.|
|itemIndex|INTEGER|Index to item to select.|

## Examples
==== VectorScript ====
```pascal
SetImagePopupSelectedItem(dialogID, componentID, 4);
```
==== Python ====
```python

```

## See Also
VS Functions:
InsertImagePopupObjectItem
| GetNumImagePopupItems
| GetImagePopupObject
| GetImagePopupObjectItemIndex
| GetImagePopupSelectedItem
| RemoveImagePopupItem
| RemoveAllImagePopupItems

## Version
Availability: from VectorWorks10.0

## Category
* Dialogs - Modern